# Assessment Problem
Write a Python script that processes sensor data from a zip file (`sensor_data_2025.zip`). The script should:
1. Extract data from nested city zip files (e.g., `munich_data.zip`, `tokyo_data.zip`), reading ``readings.csv`` and `station_info.json` from each.
2. Add a `city` column to each DataFrame with the city's name.
3. Combine the data into two main DataFrames: one for readings and one for station info.
4. Merge these two DataFrames on `station_id`.
5. Clean the merged data by keeping only `active` stations and removing rows with missing `temperature_celsius` or `pm2_5`.
6. Calculate the average temperature and PM2.5 for each city.
7. Save the city summary as a CSV file named `city_summary_report.csv` with columns `city`, `average_temperature`, and `average_pm2_5`.

## TASK 1: Load and combine data

Go through each city's zip file, read the `readings.csv` and `station_info.json` files, add a 'city' column to each DataFrame, and combine them into `all_readings_df` and `all_station_info_df`.

**Reasoning**:
TASK 1 requires extracting data from nested zip files, processing them, and combining them into two dataframes. This involves using the zipfile library and pandas for data manipulation.

In [1]:
# WRITE YOUR CODE HERE
import zipfile as zf

In [7]:
def view_zip_items(dir_name):
    with zf.ZipFile(dir_name,'r') as zip_file_obj:
        files = zip_file_obj.namelist()
    return files

In [8]:
def extract_zip_items(dir_name):
    with zf.ZipFile(dir_name,'r') as zip_file_obj_1:
        zip_file_obj_1.extractall(f'{dir_name}_extracted_files')

In [10]:
sensor_data_files = view_zip_items('sensor_data_2025.zip')

In [11]:
sensor_data_files

['munich_data.zip', 'tokyo_data.zip', 'sydney_data.zip']

In [12]:
extract_zip_items('sensor_data_2025.zip')

import os
sensor_data_files = os.listdir('sensor_data_2025.zip_extracted_files')
sensor_data_files

['munich_data.zip', 'sydney_data.zip', 'tokyo_data.zip']

In [15]:
for zip_file in sensor_data_files:
    file_name = 'sensor_data_2025.zip_extracted_files/'+zip_file
    extract_zip_items(file_name)

In [16]:
os.getcwd()

'C:\\Users\\Likhith.Cholleti\\OneDrive - Coforge Limited\\Desktop\\PY_FA_2025_Likhith\\Python Assessment.zip_extracted_zip'

In [17]:
import pandas as pd
tokyo_csv_data = pd.read_csv("tokyo_data.zip_extracted_files/readings.csv")
tokyo_json_data = pd.read_json("tokyo_data.zip_extracted_files/station_info.json")

In [18]:
tokyo_csv_data.head()

,station_id,timestamp,temperature_celsius,humidity_percent,pm2_5
0,1006,2025-03-05 23:00:00,11.14,92.50,43.29
1,1006,2025-03-31 01:00:00,9.97,94.61,34.22
2,1006,2025-01-14 09:00:00,18.95,54.45,36.74
3,1006,2025-02-01 02:00:00,16.94,61.41,13.78
4,1006,2025-01-27 14:00:00,14.38,54.03,10.38

In [19]:
tokyo_json_data.head()

,station_id,location,status,deployment_year
0,1006,"{'latitude': 35.668296, 'longitude': 139.765741}",active,2018
1,1007,"{'latitude': 35.696896, 'longitude': 139.727376}",active,2018
2,1008,"{'latitude': 35.680416, 'longitude': 139.707532}",active,2023
3,1009,"{'latitude': 35.667885, 'longitude': 139.730315}",active,2023
4,1010,"{'latitude': 35.61944, 'longitude': 139.76487}",active,2020

In [20]:
tokyo_csv_data.dtypes

station_id               int64
timestamp               object
temperature_celsius    float64
humidity_percent       float64
pm2_5                  float64
dtype: object

In [21]:
tokyo_csv_data['city'] = 'tokyo'

In [23]:
tokyo_csv_data.head()

,station_id,timestamp,temperature_celsius,humidity_percent,pm2_5,city
0,1006,2025-03-05 23:00:00,11.14,92.50,43.29,tokyo
1,1006,2025-03-31 01:00:00,9.97,94.61,34.22,tokyo
2,1006,2025-01-14 09:00:00,18.95,54.45,36.74,tokyo
3,1006,2025-02-01 02:00:00,16.94,61.41,13.78,tokyo
4,1006,2025-01-27 14:00:00,14.38,54.03,10.38,tokyo

In [24]:
tokyo_json_data['city'] = 'tokyo'

In [25]:
tokyo_json_data.head()

,station_id,location,status,deployment_year,city
0,1006,"{'latitude': 35.668296, 'longitude': 139.765741}",active,2018,tokyo
1,1007,"{'latitude': 35.696896, 'longitude': 139.727376}",active,2018,tokyo
2,1008,"{'latitude': 35.680416, 'longitude': 139.707532}",active,2023,tokyo
3,1009,"{'latitude': 35.667885, 'longitude': 139.730315}",active,2023,tokyo
4,1010,"{'latitude': 35.61944, 'longitude': 139.76487}",active,2020,tokyo

In [26]:
sydney_csv_data = pd.read_csv("sydney_data.zip_extracted_files/readings.csv")
sydney_json_data = pd.read_json("sydney_data.zip_extracted_files/station_info.json")
munich_csv_data = pd.read_csv("munich_data.zip_extracted_files/readings.csv")
munich_json_data = pd.read_json("munich_data.zip_extracted_files/station_info.json")

In [27]:
sydney_csv_data['city'] = 'sydney'
sydney_json_data['city'] = 'sydney'
munich_csv_data['city'] = 'munich'
munich_json_data['city'] = 'munich'

In [28]:
sydney_csv_data.head()

,station_id,timestamp,temperature_celsius,humidity_percent,pm2_5,city
0,1011,2025-02-15 04:00:00,21.86,76.34,59.35,sydney
1,1011,2025-02-28 13:00:00,18.90,50.89,21.21,sydney
2,1011,2025-02-09 20:00:00,29.05,51.06,59.63,sydney
3,1011,2025-01-25 13:00:00,26.43,65.09,39.54,sydney
4,1011,2025-03-16 15:00:00,29.30,46.26,7.25,sydney

In [29]:
munich_csv_data.head()

,station_id,timestamp,temperature_celsius,humidity_percent,pm2_5,city
0,1001,2025-02-04 23:00:00,14.17,77.11,22.80,munich
1,1001,2025-01-06 16:00:00,2.66,60.41,29.61,munich
2,1001,2025-01-01 13:00:00,0.31,53.84,42.90,munich
3,1001,2025-01-20 11:00:00,14.97,80.40,NaN,munich
4,1001,2025-02-12 06:00:00,14.22,78.14,62.48,munich

In [30]:
len(munich_csv_data)

500

In [33]:
all_readings_df = pd.concat([tokyo_csv_data,sydney_csv_data,munich_csv_data],ignore_index=True)

In [34]:
all_readings_df.head()

,station_id,timestamp,temperature_celsius,humidity_percent,pm2_5,city
0,1006,2025-03-05 23:00:00,11.14,92.50,43.29,tokyo
1,1006,2025-03-31 01:00:00,9.97,94.61,34.22,tokyo
2,1006,2025-01-14 09:00:00,18.95,54.45,36.74,tokyo
3,1006,2025-02-01 02:00:00,16.94,61.41,13.78,tokyo
4,1006,2025-01-27 14:00:00,14.38,54.03,10.38,tokyo

In [35]:
len(all_readings_df)

1500

In [36]:
all_station_info_df = pd.concat([tokyo_json_data,sydney_json_data,munich_json_data],ignore_index=True)

In [37]:
all_station_info_df.dtypes

station_id          int64
location           object
status             object
deployment_year     int64
city               object
dtype: object

In [38]:
len(all_station_info_df)

15

In [39]:
len(munich_json_data)

5

## TASK 2: Merge dataframes

Merge the `all_readings_df` and `all_station_info_df` into a single DataFrame using the `station_id` column.

**Reasoning**:
Merge the two dataframes `all_readings_df` and `all_station_info_df` on the `station_id` column and display the head of the resulting dataframe to verify the merge.

In [40]:
# WRITE YOUR CODE HERE
all_readings_df.dtypes

station_id               int64
timestamp               object
temperature_celsius    float64
humidity_percent       float64
pm2_5                  float64
city                    object
dtype: object

In [41]:
all_station_info_df.dtypes

station_id          int64
location           object
status             object
deployment_year     int64
city               object
dtype: object

In [46]:
all_station_info_df.head()

,station_id,location,status,deployment_year,city
0,1006,"{'latitude': 35.668296, 'longitude': 139.765741}",active,2018,tokyo
1,1007,"{'latitude': 35.696896, 'longitude': 139.727376}",active,2018,tokyo
2,1008,"{'latitude': 35.680416, 'longitude': 139.707532}",active,2023,tokyo
3,1009,"{'latitude': 35.667885, 'longitude': 139.730315}",active,2023,tokyo
4,1010,"{'latitude': 35.61944, 'longitude': 139.76487}",active,2020,tokyo

In [47]:
combined_data = all_readings_df.merge(all_station_info_df,on='station_id')

In [48]:
len(combined_data)

1500

In [52]:
combined_data.tail()

,station_id,timestamp,temperature_celsius,humidity_percent,pm2_5,city_x,location,status,deployment_year,city_y
1495,1005,2025-02-07 05:00:00,11.20,67.52,5.02,munich,"{'latitude': 48.100052, 'longitude': 11.571568}",active,2018,munich
1496,1005,2025-01-14 08:00:00,6.77,59.94,70.04,munich,"{'latitude': 48.100052, 'longitude': 11.571568}",active,2018,munich
1497,1005,2025-02-16 07:00:00,8.46,85.22,27.48,munich,"{'latitude': 48.100052, 'longitude': 11.571568}",active,2018,munich
1498,1005,2025-03-18 10:00:00,4.37,72.65,47.22,munich,"{'latitude': 48.100052, 'longitude': 11.571568}",active,2018,munich
1499,1005,2025-03-26 14:00:00,8.84,31.80,25.66,munich,"{'latitude': 48.100052, 'longitude': 11.571568}",active,2018,munich

In [58]:
combined_data_frame = combined_data.drop('city_x',axis=1)

In [57]:
combined_data.head()

,station_id,timestamp,temperature_celsius,humidity_percent,pm2_5,city_x,location,status,deployment_year,city_y
0,1006,2025-03-05 23:00:00,11.14,92.50,43.29,tokyo,"{'latitude': 35.668296, 'longitude': 139.765741}",active,2018,tokyo
1,1006,2025-03-31 01:00:00,9.97,94.61,34.22,tokyo,"{'latitude': 35.668296, 'longitude': 139.765741}",active,2018,tokyo
2,1006,2025-01-14 09:00:00,18.95,54.45,36.74,tokyo,"{'latitude': 35.668296, 'longitude': 139.765741}",active,2018,tokyo
3,1006,2025-02-01 02:00:00,16.94,61.41,13.78,tokyo,"{'latitude': 35.668296, 'longitude': 139.765741}",active,2018,tokyo
4,1006,2025-01-27 14:00:00,14.38,54.03,10.38,tokyo,"{'latitude': 35.668296, 'longitude': 139.765741}",active,2018,tokyo

In [61]:
combined_data_frame = combined_data_frame.rename(columns={'city_y':'city'})

In [63]:
combined_data_frame.head()

,station_id,timestamp,temperature_celsius,humidity_percent,pm2_5,location,status,deployment_year,city
0,1006,2025-03-05 23:00:00,11.14,92.50,43.29,"{'latitude': 35.668296, 'longitude': 139.765741}",active,2018,tokyo
1,1006,2025-03-31 01:00:00,9.97,94.61,34.22,"{'latitude': 35.668296, 'longitude': 139.765741}",active,2018,tokyo
2,1006,2025-01-14 09:00:00,18.95,54.45,36.74,"{'latitude': 35.668296, 'longitude': 139.765741}",active,2018,tokyo
3,1006,2025-02-01 02:00:00,16.94,61.41,13.78,"{'latitude': 35.668296, 'longitude': 139.765741}",active,2018,tokyo
4,1006,2025-01-27 14:00:00,14.38,54.03,10.38,"{'latitude': 35.668296, 'longitude': 139.765741}",active,2018,tokyo

## TASK 3: Clean data

Filter the merged DataFrame to keep only 'active' stations and remove rows with missing values in 'temperature_celsius' or 'pm2_5'.

**Reasoning**:
Filter the merged dataframe to keep only active stations and remove rows with missing values in the specified columns.

In [64]:
# WRITE YOUR CODE HERE
combined_data_frame.isnull().sum()

station_id              0
timestamp               0
temperature_celsius    14
humidity_percent       23
pm2_5                  26
location                0
status                  0
deployment_year         0
city                    0
dtype: int64

In [66]:
filtered_data_task3 = combined_data_frame.dropna(subset=['temperature_celsius','pm2_5'],how='any')

In [67]:
filtered_data_task3.isnull().sum()

station_id              0
timestamp               0
temperature_celsius     0
humidity_percent       23
pm2_5                   0
location                0
status                  0
deployment_year         0
city                    0
dtype: int64

In [71]:
len(filtered_data_task3)

1460

In [74]:
filtered_data_task3 = filtered_data_task3[filtered_data_task3.status=='active']

In [75]:
len(filtered_data_task3)

1361

In [79]:
len(filtered_data_task3[filtered_data_task3.status=='maintenance'])

0

In [80]:
filtered_data_task3.isnull().sum()

station_id              0
timestamp               0
temperature_celsius     0
humidity_percent       22
pm2_5                   0
location                0
status                  0
deployment_year         0
city                    0
dtype: int64

In [81]:
filtered_data_task3[['status','humidity_percent']]

      status  humidity_percent
0     active             92.50
1     active             94.61
2     active             54.45
3     active             61.41
4     active             54.03
...      ...               ...
1495  active             67.52
1496  active             59.94
1497  active             85.22
1498  active             72.65
1499  active             31.80

[1361 rows x 2 columns]

## TASK 4: Analyze data

Calculate the average 'temperature_celsius' and 'pm2_5' for each city.

**Reasoning**:
Calculate the mean temperature and PM2.5 for each city by grouping the cleaned_df by city and applying the mean aggregation. Then display the head of the resulting dataframe.

In [84]:
# WRITE YOUR CODE HERE
resulting_data_frame_task4 = filtered_data_task3.groupby('city')[['temperature_celsius','pm2_5']].mean()

In [85]:
resulting_data_frame_task4.head()

        temperature_celsius      pm2_5
city
munich             7.550826  40.038595
sydney            24.261897  39.060256
tokyo             12.685729  39.741027

In [86]:
len(resulting_data_frame_task4)

3

In [88]:
len(resulting_data_frame_task4)

3

In [89]:
len(filtered_data_task3)

1361

## TASK 5: Save report

Save the city summary as a CSV file named `city_summary_report.csv` with the specified columns.

**Reasoning**:
Reset the index, rename the city column, and save the city summary DataFrame to a CSV file.

In [3]:
# WRITE YOUR CODE HERE